# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 小目标检测 PRR v3-SSA-P2 - 精度优先进一步精简版
#
# 精简原则：
# 1. 基于 P1：已删除 FrequencyFocusedDownSampling(38/39)
# 2. 本版继续去掉 P2 TopBasicLayer，仅裁剪最浅层上下文建模
# 3. 保留 P3 TopBasicLayer、Refocus、MFFF、SAC、AsDDet 不动
# 4. 保持 P2 检测头继续直接使用 MFFF 输出

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

loss: NWD

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25, 1, True, True, True, False, 1]]  # 2: shallow, Sobel only
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25, 1, True, True, True, True, 2]]   # 4: mid, Sobel + SAConv(d=2)
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 2, C3k2, [512, True, 0.5, 1, True, True, True, True, 3]]     # 6: deep, Sobel + SAConv(d=3)
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
  - [-1, 2, C3k2, [1024, True, 0.5, 1, True, True, True, True, 3]]    # 8: deep, Sobel + SAConv(d=3)
  - [-1, 1, SPPF, [1024, 5]]           # 9

head:
  # ===== FPN top-down =====
  - [-1, 1, Conv, [512, 1, 1]]                        # 10
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 11
  - [[-1, 6], 1, Concat, [1]]                         # 12
  - [-1, 1, C2f, [512, False]]                        # 13

  - [-1, 1, Conv, [256, 1, 1]]                        # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 15
  - [[-1, 4], 1, Concat, [1]]                         # 16
  - [-1, 2, C2f, [256, False]]                        # 17

  - [-1, 1, Conv, [128, 1, 1]]                        # 18
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 19
  - [[-1, 2], 1, Concat, [1]]                         # 20
  - [-1, 3, C2f, [128, False]]                        # 21

  # ===== HFAMPAN 金字塔聚合 =====
  - [[-1, -4, -8, 9], 1, PyramidPoolAgg, [512, 2, 'torch']]  # 22

  # ===== P2 输出分支（P2: 去掉 TopBasicLayer）=====
  - [[21, 21], 1, LAF_h, []]                           # 23
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool2, [128]] # 24
  - [-1, 3, RepBlock, [128]]                           # 25

  # ===== P3 输出分支（保留 TopBasicLayer）=====
  - [17, 1, TopBasicLayer, [256]]                      # 26
  - [[26, 17], 1, LAF_h, []]                           # 27
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool3, [256]] # 28
  - [-1, 3, RepBlock, [256]]                           # 29

  # ===== P4 输出分支 =====
  - [[29, 13], 1, LAF_h, []]                           # 30
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool4, [512]] # 31
  - [-1, 2, RepBlock, [512]]                           # 32

  # ===== PRR: grid_sample 局部重聚焦 =====
  - [25, 1, RefocusSingle, [gridsample]]               # 33
  - [29, 1, RefocusSingle, [gridsample]]               # 34

  # ===== 小目标增强 =====
  - [33, 1, MFFF, [128, 0.25]]                         # 35
  - [34, 1, MFFF, [256, 0.25]]                         # 36

  # ===== 语义对齐校准（延续 P1：直接吃 MFFF 输出）=====
  - [[35, 36], 1, SemanticAlignmenCalibration, []]     # 37

  # ===== 检测头 - 三尺度 [P2, P3, P4] =====
  - [[35, 37, 32], 1, AsDDet, [nc]]                    # 38
