# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 VisDrone 定向版本
# 基于 PRR-v3 做混合尺度回调：
# 1. 恢复 P5 检测分支，缓解 medium/large 类别召回不足
# 2. FPN 上采样由 nearest 改为 DySample，提升密集场景细节恢复
# 3. 回归损失由 NWD 改为 WIoU，改善混合尺度框回归稳定性
#
# 设计原则：
# - 保留 PRR-v3 的 P2/P3 小目标增强链路（RefocusSingle + MFFF + FFDS + SAC）
# - 不改训练器逻辑，不引入新的 Python 模块
# - 仅通过 YAML 结构回调到更适合 VisDrone 的 mixed-scale 版本

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

loss: WIoU

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 2, C3k2, [512, True]]         # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]        # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9

head:
  # ===== FPN top-down，改用 DySample =====
  # P5->P4
  - [-1, 1, Conv, [512, 1, 1]]                        # 10
  - [-1, 1, DySample, []]                             # 11
  - [[-1, 6], 1, Concat, [1]]                         # 12
  - [-1, 1, C2f, [512, False]]                        # 13

  # P4->P3
  - [-1, 1, Conv, [256, 1, 1]]                        # 14
  - [-1, 1, DySample, []]                             # 15
  - [[-1, 4], 1, Concat, [1]]                         # 16
  - [-1, 2, C2f, [256, False]]                        # 17

  # P3->P2
  - [-1, 1, Conv, [128, 1, 1]]                        # 18
  - [-1, 1, DySample, []]                             # 19
  - [[-1, 2], 1, Concat, [1]]                         # 20
  - [-1, 3, C2f, [128, False]]                        # 21

  # ===== HFAMPAN 金字塔聚合 =====
  - [[-1, -4, -8, 9], 1, PyramidPoolAgg, [512, 2, 'torch']]  # 22

  # ===== P2 输出分支 =====
  - [21, 1, TopBasicLayer, [128]]                      # 23
  - [[23, 21], 1, LAF_h, []]                           # 24
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool2, [128]] # 25
  - [-1, 3, RepBlock, [128]]                           # 26

  # ===== P3 输出分支 =====
  - [17, 1, TopBasicLayer, [256]]                      # 27
  - [[27, 17], 1, LAF_h, []]                           # 28
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool3, [256]] # 29
  - [-1, 3, RepBlock, [256]]                           # 30

  # ===== P4 输出分支 =====
  - [[30, 13], 1, LAF_h, []]                           # 31
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool4, [512]] # 32
  - [-1, 2, RepBlock, [512]]                           # 33

  # ===== PRR + 小目标增强 =====
  - [26, 1, RefocusSingle, [gridsample]]               # 34
  - [30, 1, RefocusSingle, [gridsample]]               # 35
  - [34, 1, MFFF, [128, 0.25]]                         # 36
  - [35, 1, MFFF, [256, 0.25]]                         # 37
  - [36, 1, FrequencyFocusedDownSampling, [128]]       # 38
  - [37, 1, FrequencyFocusedDownSampling, [256]]       # 39
  - [[38, 39], 1, SemanticAlignmenCalibration, []]     # 40

  # ===== 恢复 P5 检测分支，适配 VisDrone mixed-scale =====
  - [33, 1, Conv, [512, 3, 2]]                         # 41 P4->P5
  - [[-1, 9], 1, Concat, [1]]                          # 42 cat backbone P5 semantic
  - [-1, 1, C2f, [1024, False]]                        # 43 P5 detect feature

  # ===== 检测头 - 四尺度 [P2, P3, P4, P5] =====
  - [[36, 40, 33, 43], 1, AsDDet, [nc]]               # 44
