# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 小目标 PRR-v3-SSA-P1 变体: NoSAC + PPA 全 C2f
#
# 相对 P1 主线 (YOLO11-HFAMPAN-AsDDet-NWD-SmallObject-PRR-v3-SSA-P1.yaml) 的差异：
# 1. PPA 输入改为 [21, 17, 13, 9]（全 C2f + SPPF，修正原索引偏差）
# 2. 删除 SAC (原 layer 38)，AsDDet P3 通道直接用 P3-MFFF (layer 37)
# 3. 总层数 40 → 39

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

loss: NWD

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25, 1, True, True, True, False, 1]]  # 2: shallow, Sobel only
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25, 1, True, True, True, True, 2]]   # 4: mid, Sobel + SAConv(d=2)
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 2, C3k2, [512, True, 0.5, 1, True, True, True, True, 3]]     # 6: deep, Sobel + SAConv(d=3)
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
  - [-1, 2, C3k2, [1024, True, 0.5, 1, True, True, True, True, 3]]    # 8: deep, Sobel + SAConv(d=3)
  - [-1, 1, SPPF, [1024, 5]]           # 9

head:
  # ===== FPN top-down =====
  - [-1, 1, Conv, [512, 1, 1]]                        # 10
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 11
  - [[-1, 6], 1, Concat, [1]]                         # 12
  - [-1, 1, C2f, [512, False]]                        # 13  (P4-td)

  - [-1, 1, Conv, [256, 1, 1]]                        # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 15
  - [[-1, 4], 1, Concat, [1]]                         # 16
  - [-1, 2, C2f, [256, False]]                        # 17  (P3-td)

  - [-1, 1, Conv, [128, 1, 1]]                        # 18
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 19
  - [[-1, 2], 1, Concat, [1]]                         # 20
  - [-1, 3, C2f, [128, False]]                        # 21  (P2-td)

  # ===== HFAMPAN 金字塔聚合（改动 #1: 全 C2f 输入 [21, 17, 13, 9]） =====
  - [[21, 17, 13, 9], 1, PyramidPoolAgg, [512, 2, 'torch']]  # 22

  # ===== P2 输出分支 =====
  - [21, 1, TopBasicLayer, [128]]                      # 23
  - [[23, 21], 1, LAF_h, []]                           # 24
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool2, [128]] # 25
  - [-1, 3, RepBlock, [128]]                           # 26

  # ===== P3 输出分支 =====
  - [17, 1, TopBasicLayer, [256]]                      # 27
  - [[27, 17], 1, LAF_h, []]                           # 28
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool3, [256]] # 29
  - [-1, 3, RepBlock, [256]]                           # 30

  # ===== P4 输出分支 =====
  - [[30, 13], 1, LAF_h, []]                           # 31
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool4, [512]] # 32
  - [-1, 2, RepBlock, [512]]                           # 33

  # ===== PRR: grid_sample 局部重聚焦 =====
  - [26, 1, RefocusSingle, [gridsample]]               # 34
  - [30, 1, RefocusSingle, [gridsample]]               # 35

  # ===== 小目标增强 MFFF =====
  - [34, 1, MFFF, [128, 0.25]]                         # 36
  - [35, 1, MFFF, [256, 0.25]]                         # 37

  # ===== 检测头（改动 #2: 已删除 SAC，AsDDet 直接吃 [P2-MFFF, P3-MFFF, P4-RepBlock]） =====
  - [[36, 37, 33], 1, AsDDet, [nc]]                    # 38
