# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 小目标检测 PRR v3 lite12 - 在不移除 34~40 结构的前提下做轻量化
#
# 相对 PRR-v3 的改动：
# 1) layer26 RepBlock repeat: 3 -> 2
# 2) layer30 RepBlock repeat: 3 -> 2
# 3) layer33 RepBlock repeat: 2 -> 1
#
# 其余结构保持与 PRR-v3 一致（尤其保留 34~40 小目标增强链路）

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

loss: NWD

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 2, C3k2, [512, True]]         # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32（保留，用于 SPPF 语义聚合）
  - [-1, 2, C3k2, [1024, True]]        # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9（保留，为 HFAMPAN 提供深层语义）

head:
  # ===== FPN top-down（保留完整，P5 语义仍参与融合）=====
  # P5->P4
  - [-1, 1, Conv, [512, 1, 1]]                        # 10
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 11
  - [[-1, 6], 1, Concat, [1]]                         # 12
  - [-1, 1, C2f, [512, False]]                        # 13

  # P4->P3
  - [-1, 1, Conv, [256, 1, 1]]                        # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 15
  - [[-1, 4], 1, Concat, [1]]                         # 16
  - [-1, 2, C2f, [256, False]]                        # 17

  # P3->P2
  - [-1, 1, Conv, [128, 1, 1]]                        # 18
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 19
  - [[-1, 2], 1, Concat, [1]]                         # 20
  - [-1, 3, C2f, [128, False]]                        # 21

  # ===== HFAMPAN 金字塔聚合（仍包含 P5=layer9 的语义）=====
  - [[-1, -4, -8, 9], 1, PyramidPoolAgg, [512, 2, 'torch']]  # 22

  # ===== P2 输出分支（轻量化：RepBlock 3->2）=====
  - [21, 1, TopBasicLayer, [128]]                      # 23
  - [[23, 21], 1, LAF_h, []]                          # 24
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool2, [128]] # 25
  - [-1, 2, RepBlock, [128]]                           # 26  repeat=2 (was 3)

  # ===== P3 输出分支（轻量化：RepBlock 3->2）=====
  - [17, 1, TopBasicLayer, [256]]                      # 27
  - [[27, 17], 1, LAF_h, []]                          # 28
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool3, [256]] # 29
  - [-1, 2, RepBlock, [256]]                           # 30  repeat=2 (was 3)

  # ===== P4 输出分支（轻量化：RepBlock 2->1）=====
  - [[30, 13], 1, LAF_h, []]                          # 31
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool4, [512]] # 32
  - [-1, 1, RepBlock, [512]]                           # 33  repeat=1 (was 2)

  # ===== PRR: grid_sample 局部重聚焦重采样（保留）=====
  - [26, 1, RefocusSingle, [gridsample]]               # 34  P2 重聚焦
  - [30, 1, RefocusSingle, [gridsample]]               # 35  P3 重聚焦

  # ===== 小目标增强（保留）=====
  - [34, 1, MFFF, [128, 0.25]]                        # 36
  - [35, 1, MFFF, [256, 0.25]]                        # 37

  # ===== 频率聚焦下采样（保留）=====
  - [36, 1, FrequencyFocusedDownSampling, [128]]       # 38
  - [37, 1, FrequencyFocusedDownSampling, [256]]       # 39

  # ===== 语义对齐校准（保留）=====
  - [[38, 39], 1, SemanticAlignmenCalibration, []]     # 40

  # ===== 检测头（三尺度）=====
  - [[36, 40, 33], 1, AsDDet, [nc]]                   # 41
