# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 小目标检测 PRR v3 - 去掉 P5 检测层 + grid_sample 重聚焦
#
# 核心改造：
# 1. 删除 P5 独立检测支路（34/35/36），保留 backbone P5 语义用于 SPPF/HFAMPAN 聚合
# 2. RefocusSingle 从 softmask 切换到 gridsample（显式局部重采样）
# 3. 最终检测头从四尺度 [P2,P3,P4,P5] 改为三尺度 [P2,P3,P4]
# 4. P4 RepBlock repeat 1->2（回收 P5 预算，增强最高检测层表征）
#
# 论文依据：
# - LSOD-YOLO：引入 P2 后去除 P5 检测层，减少参数量和 GFLOPs，同时提升小目标 mAP
# - DySample：基于采样点偏移的动态采样优于普通上采样，更适合小目标细节保留
# - 本工作将 grid_sample 作为 PRR 的"局部重聚焦采样器"，实现显式空间重采样
#
# 尺度职责重分配：
# - P2 (stride=4)：tiny 目标 (0-16px)
# - P3 (stride=8)：small 目标 (16-32px)
# - P4 (stride=16)：medium + large 目标 (32px+)

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

loss: NWD

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 2, C3k2, [512, True]]         # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32（保留，用于 SPPF 语义聚合）
  - [-1, 2, C3k2, [1024, True]]        # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9（保留，为 HFAMPAN 提供深层语义）

head:
  # ===== FPN top-down（保留完整，P5 语义仍参与融合）=====
  # P5->P4
  - [-1, 1, Conv, [512, 1, 1]]                        # 10
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 11
  - [[-1, 6], 1, Concat, [1]]                         # 12
  - [-1, 1, C2f, [512, False]]                        # 13  repeat=1（P5 语义轻量传递）

  # P4->P3
  - [-1, 1, Conv, [256, 1, 1]]                        # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 15
  - [[-1, 4], 1, Concat, [1]]                         # 16
  - [-1, 2, C2f, [256, False]]                        # 17  repeat=2

  # P3->P2
  - [-1, 1, Conv, [128, 1, 1]]                        # 18
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 19
  - [[-1, 2], 1, Concat, [1]]                         # 20
  - [-1, 3, C2f, [128, False]]                        # 21  repeat=3（P2 小目标核心，保持深度）

  # ===== HFAMPAN 金字塔聚合（仍包含 P5=layer9 的语义）=====
  - [[-1, -4, -8, 9], 1, PyramidPoolAgg, [512, 2, 'torch']]  # 22

  # ===== P2 输出分支（完整保留，小目标核心）=====
  - [21, 1, TopBasicLayer, [128]]                      # 23
  - [[23, 21], 1, LAF_h, []]                          # 24
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool2, [128]] # 25
  - [-1, 3, RepBlock, [128]]                           # 26  repeat=3

  # ===== P3 输出分支（完整保留）=====
  - [17, 1, TopBasicLayer, [256]]                      # 27
  - [[27, 17], 1, LAF_h, []]                          # 28
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool3, [256]] # 29
  - [-1, 3, RepBlock, [256]]                           # 30  repeat=3

  # ===== P4 输出分支（回收 P5 预算，RepBlock 1->2）=====
  - [[30, 13], 1, LAF_h, []]                          # 31
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool4, [512]] # 32
  - [-1, 2, RepBlock, [512]]                           # 33  repeat=2（原 PRR 版为 1，回收 P5 预算）

  # ===== PRR: grid_sample 局部重聚焦重采样 =====
  - [26, 1, RefocusSingle, [gridsample]]               # 34  P2 重聚焦
  - [30, 1, RefocusSingle, [gridsample]]               # 35  P3 重聚焦

  # ===== 小目标增强 =====
  - [34, 1, MFFF, [128, 0.25]]                        # 36  P2 多频率特征融合
  - [35, 1, MFFF, [256, 0.25]]                        # 37  P3 多频率特征融合

  # ===== 频率聚焦下采样 =====
  - [36, 1, FrequencyFocusedDownSampling, [128]]       # 38  P2 频率聚焦
  - [37, 1, FrequencyFocusedDownSampling, [256]]       # 39  P3 频率聚焦

  # ===== 语义对齐校准（P2/P3 对齐，不变）=====
  - [[38, 39], 1, SemanticAlignmenCalibration, []]     # 40

  # ===== 检测头 - 三尺度 [P2, P3, P4] =====
  - [[36, 40, 33], 1, AsDDet, [nc]]                   # 41
