# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 小目标检测版本 - 基于原始配置添加P2层

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# 使用NWD损失函数，适合小目标检测
loss: NWD

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  # 原始的P5->P4->P3处理
  - [-1, 1, Conv, [512, 1, 1]] # 10
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 11
  - [[-1, 6], 1, Concat, [1]] # 12
  - [-1, 3, C2f, [512, False]] # 13

  - [-1, 1, Conv, [256, 1, 1]] # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15
  - [[-1, 4], 1, Concat, [1]] # 16
  - [-1, 3, C2f, [256, False]] # 17

  # 新增P3->P2处理用于小目标检测
  - [-1, 1, Conv, [128, 1, 1]] # 18
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 19
  - [[-1, 2], 1, Concat, [1]] # 20 连接P2层
  - [-1, 3, C2f, [128, False]] # 21 P2层特征处理

  # HFAMPAN金字塔聚合 - 使用P3,P4,P5 (保持原始结构)
  - [[17, -5, 9], 1, PyramidPoolAgg, [512, 2, 'torch']] # 22

  # P3层输出分支 (原始结构)
  - [-1, 1, TopBasicLayer, [512]] # 23
  - [[-3, -7], 1, LAF_h, []] # 24
  - [[-1, -2], 1, InjectionMultiSum_Auto_pool3, [256]] # 25
  - [-1, 3, RepBlock, [512]] # 26

  # P4层输出分支 (原始结构)
  - [[-1, 10], 1, LAF_h, []] # 27
  - [[-1, -5], 1, InjectionMultiSum_Auto_pool4, [512]] # 28
  - [-1, 3, RepBlock, [1024]] # 29

  # P2层输出分支 (新增用于小目标检测)
  - [21, 1, Conv, [128, 3, 1]] # 30 P2层简单处理

  # 四尺度检测头：P2/4, P3/8, P4/16, P5/32
  - [[30, 26, 29], 1, Detect, [nc]] # 31 三尺度检测头 (P2, P3, P4)

# 检测头部分 - 使用AsDDet进行自适应检测
Head: 
  - [[30, 26, 29], 1, AsDDet, [nc]] # 自适应空间分解检测头，支持三个尺度

# 小目标检测配置说明：
# 1. P2层 (1/4分辨率): 专门用于检测极小目标 (0-16像素)
# 2. P3层 (1/8分辨率): 用于检测小目标 (16-32像素)  
# 3. P4层 (1/16分辨率): 用于检测中等目标 (32-96像素)
#
# 关键改进：
# - 增加P2层特征图，提供更高分辨率的特征表示
# - 保持原有的HFAMPAN核心结构
# - 使用NWD损失函数，更适合小目标检测
# - 简化复杂模块，确保稳定运行