# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-seg instance segmentation model. For Usage examples see https://docs.ultralytics.com/tasks/segment  |  YOLO11Pro https://github.com/iscyy/YOLO11Pro

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-seg.yaml' will call yolo11-seg.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 355 layers, 2876848 parameters, 2876832 gradients, 10.5 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 355 layers, 10113248 parameters, 10113232 gradients, 35.8 GFLOPs
  m: [0.50, 1.00, 512] # summary: 445 layers, 22420896 parameters, 22420880 gradients, 123.9 GFLOPs
  l: [1.00, 1.00, 512] # summary: 667 layers, 27678368 parameters, 27678352 gradients, 143.0 GFLOPs
  x: [1.00, 1.50, 512] # summary: 667 layers, 62142656 parameters, 62142640 gradients, 320.2 GFLOPs


# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLO11n head
head:
  - [4, 1, Conv, [64, 1, 1]]
  - [6, 1, Conv, [128, 1, 1]]
  - [9, 1, Conv, [256, 1, 1]]
  - [10, 1, Conv, [64, 1, 1]]
  - [11, 1, Conv, [128, 1, 1]]
  - [12, 1, Conv, [256, 1, 1]]
  - [[13, 14], 1, ASFF_2, [64, 0]]  
  - [[13, 14], 1, ASFF_2, [128, 1]]  
  - [16, 1, BasicBlock, [64]]
  - [17, 1, BasicBlock, [128]]
  - [[18, 19, 15], 1, ASFF_3, [64, 0]]  
  - [[18, 19, 15], 1, ASFF_3, [128, 1]] 
  - [[18, 19, 15], 1, ASFF_3, [256, 2]]
  - [20, 1, BasicBlock, [64]]
  - [21, 1, BasicBlock, [128]]
  - [22, 1, BasicBlock, [256]]
  - [23, 1, Conv, [256, 1, 1]]
  - [24, 1, Conv, [512, 1, 1]]
  - [25, 1, Conv, [1024, 1, 1]]

  - [[26, 27, 28], 1, Segment, [nc, 32, 256]] # Detect(P3, P4, P5)
