# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect, |  YOLO11Pro https://github.com/iscyy/YOLO11Pro

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

loss: WIoU

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, CPNMSB, [128]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, CPNMSB, [256]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, CPNMSB, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, CPNMSB, [1024]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

head:
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  
  - [-1, 3, C2f, [512, False]]  

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 3, C2f, [256, False]]

  - [[-1, -5, 9], 1, PyramidPoolAgg, [512, 2, 'torch']]

  - [-1, 1, TopBasicLayer, [512]]
  - [[-3, -7], 1, LAF_h, []]
  - [[-1, -2], 1, InjectionMultiSum_Auto_pool3, [256]]
  - [-1, 3, RepBlock, [512]]

  - [[-1, 10], 1, LAF_h, []] 
  - [[-1, -5], 1, InjectionMultiSum_Auto_pool4, [512]] 
  - [-1, 3, RepBlock, [1024]]

  - [[17, 22, 25], 1, Detect, [nc]]