# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-pose keypoints/pose estimation model. For Usage examples see https://docs.ultralytics.com/tasks/pose  |  YOLO11Pro https://github.com/iscyy/YOLO11Pro

# Parameters
nc: 80 # number of classes
kpt_shape: [17, 3] # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolo11n-pose.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 344 layers, 2908507 parameters, 2908491 gradients, 7.7 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 344 layers, 9948811 parameters, 9948795 gradients, 23.5 GFLOPs
  m: [0.50, 1.00, 512] # summary: 434 layers, 20973273 parameters, 20973257 gradients, 72.3 GFLOPs
  l: [1.00, 1.00, 512] # summary: 656 layers, 26230745 parameters, 26230729 gradients, 91.4 GFLOPs
  x: [1.00, 1.50, 512] # summary: 656 layers, 58889881 parameters, 58889865 gradients, 204.3 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLO11n head
head:
  - [4, 1, Conv, [64, 1, 1]]
  - [6, 1, Conv, [128, 1, 1]]
  - [9, 1, Conv, [256, 1, 1]]
  - [10, 1, Conv, [64, 1, 1]]
  - [11, 1, Conv, [128, 1, 1]]
  - [12, 1, Conv, [256, 1, 1]]
  - [[13, 14], 1, ASFF_2, [64, 0]]  
  - [[13, 14], 1, ASFF_2, [128, 1]]  
  - [16, 1, BasicBlock, [64]]
  - [17, 1, BasicBlock, [128]]
  - [[18, 19, 15], 1, ASFF_3, [64, 0]]  
  - [[18, 19, 15], 1, ASFF_3, [128, 1]] 
  - [[18, 19, 15], 1, ASFF_3, [256, 2]]
  - [20, 1, BasicBlock, [64]]
  - [21, 1, BasicBlock, [128]]
  - [22, 1, BasicBlock, [256]]
  - [23, 1, Conv, [256, 1, 1]]
  - [24, 1, Conv, [512, 1, 1]]
  - [25, 1, Conv, [1024, 1, 1]]

  - [[26, 27, 28], 1, Pose, [nc, kpt_shape]] # Detect(P3, P4, P5)
